creator83/STM32F030K6/cpp/lib/inc/pwm.h
#include "stm32f0xx.h"
#include "pin.h"
#include "gtimer.h"
#include "atimer.h"
/*
namespace PwmDef
{
//===Defenitions===//
//pwm
const Gpio::Port PwmPort = Gpio::B;
const uint8_t PwmPin = 0;
const Gpio::Afmode PwmAlt = Gpio::AF4;	
const Gtimer::nChannel PwmCh = Gtimer::channel3;
}*/




#ifndef PWM_H
#define PWM_H

class Pwm;



class Pwm 
{
  //variables
public:

	enum mode {EdgePwm, CenterPwm1, CenterPwm2, CenterPwm3};
	enum pulseMode {highPulse, lowPulse};
	enum inverse {off=6, on};

private:
	typedef void(Pwm::*PtrPwm)(Pwm::pulseMode);
	Pin pwmPin;
	Gtimer * timer;
	Atimer * timer1;
	Gtimer::nChannel pwmChannel;
	TIM_TypeDef * ptrTimer;
	static uint8_t ccrPtr [4];
	static PtrPwm funcMode [3];

public:
	Pwm (Gtimer &, Gpio::Port, uint8_t pin_, Gpio::Afmode af, Gtimer::nChannel ch, mode, pulseMode, inverse = off);
	Pwm (Atimer &, Gpio::Port, uint8_t pin_, Gpio::Afmode af, Gtimer::nChannel ch, mode, pulseMode, inverse = off);
	void setValue (uint16_t);
	void start ();
	void stop ();
private:
	void setMode ();
	void setEdgePwm (pulseMode m);
	void setCenterPwm ();
	void setCombinePwm ();

};



#endif
